In [1]:
import pandas as pd
import numpy as np
df = pd.read_csv('Employee_Salary.csv')

In [2]:
print('Information of Dataset:\n', df.info)
print('Shape of Dataset (row x column): ', df.shape)
print('Columns Name: ', df.columns)
print('Total elements in dataset:', df.size)
print('Datatype of attributes (columns):', df.dtypes)
print('First 5 rows:\n', df.head().T)
print('Last 5 rows:\n',df.tail().T)
print('Any 5 rows:\n',df.sample(5).T)

Information of Dataset:
 <bound method DataFrame.info of     ID  Experience  Age  Gender    Salary
0    1         5.0   28  Female    250000
1    2         1.0   21    Male     50000
2    3         3.0   23  Female    170000
3    4         2.0   22    Male     25000
4    5         1.0   17    Male     10000
5    6        25.0   62    Male   5001000
6    7        19.0   54  Female    800000
7    8         2.0   21  Female      9000
8    9        10.0   36  Female     61500
9   10        15.0   54  Female    650000
10  11         4.0   26  Female    250000
11  12         6.0   29    Male   1400000
12  13        14.0   39    Male   6000050
13  14         NaN   40    Male    220100
14  15         2.0   23    Male      7500
15  16         4.0   27     NaN     87000
16  17        10.0   34  Female    930000
17  18        15.0   54  Female   7900000
18  19         2.0   21    Male     15000
19  20        10.0   36    Male    330000
20  21        15.0   54    Male   6570000
21  22         4.0   26    Male     25000
22  23         5.0   29    Male   6845000
23  24         1.0   21  Female      6000
24  25         4.0   23  Female      8900
25  26         3.0   22  Female     20000
26  27         1.0   18    Male      3000
27  28        27.0   62  Female  10000000
28  29        19.0   54  Female   5000000
29  30         2.0   21  Female      6100
30  31        10.0   34    Male     80000
31  32        15.0   54    Male    900000
32  33        20.0   55  Female   1540000
33  34        19.0   53  Female   9300000
34  35        16.0   49    Male   7600000>
Shape of Dataset (row x column):  (35, 5)
Columns Name:  Index(['ID', 'Experience', 'Age', 'Gender', 'Salary'], dtype='object')
Total elements in dataset: 175
Datatype of attributes (columns): ID              int64
Experience    float64
Age             int64
Gender         object
Salary          int64
dtype: object
First 5 rows:
                  0      1       2      3      4
ID               1      2       3      4      5
Experience     5.0    1.0     3.0    2.0    1.0
Age             28     21      23     22     17
Gender      Female   Male  Female   Male   Male
Salary      250000  50000  170000  25000  10000
Last 5 rows:
                30      31       32       33       34
ID             31      32       33       34       35
Experience   10.0    15.0     20.0     19.0     16.0
Age            34      54       55       53       49
Gender       Male    Male   Female   Female     Male
Salary      80000  900000  1540000  9300000  7600000
Any 5 rows:
                 25     30      19     18     4
ID              26     31      20     19      5
Experience     3.0   10.0    10.0    2.0    1.0
Age             22     34      36     21     17
Gender      Female   Male    Male   Male   Male
Salary       20000  80000  330000  15000  10000

In [3]:
df.isna().sum()

ID            0
Experience    1
Age           0
Gender        1
Salary        0
dtype: int64

In [5]:
df['Experience'].fillna(df['Experience'].mean(),inplace=True)

C:\Users\dutta\AppData\Local\Temp\ipykernel_24140\445394033.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Experience'].fillna(df['Experience'].mean(),inplace=True)

In [6]:
df['Gender'].fillna(df['Gender'].mode()[0],inplace = True )

C:\Users\dutta\AppData\Local\Temp\ipykernel_24140\3818145922.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Gender'].fillna(df['Gender'].mode()[0],inplace = True )

In [7]:
df.isna().sum()

ID            0
Experience    0
Age           0
Gender        0
Salary        0
dtype: int64

In [8]:
df.head()

   ID  Experience  Age  Gender  Salary
0   1         5.0   28  Female  250000
1   2         1.0   21    Male   50000
2   3         3.0   23  Female  170000
3   4         2.0   22    Male   25000
4   5         1.0   17    Male   10000

In [9]:
print("groupwise information")
print("------------Experience-----------")
df['Experience'].groupby(df['Gender']).describe()

groupwise information
------------Experience-----------

        count       mean       std  min   25%  50%   75%   max
Gender
Female   18.0  10.111111  8.123234  1.0  3.25  7.5  18.0  27.0
Male     17.0   8.126298  6.982320  1.0  2.00  6.0  14.0  25.0

In [ ]:
print("-----------------Age---------------")
df[